# class Student:
#     # print("Привіт, створення класу")
#     def __init__(self,name="Яна",group="1113",age=13): #self - посилатися на себе на клас
#         self.name=name
#         self.group=group
#         self.age=age
#     def __str__(self):
#         return "Ім'я студента:"+self.name+" навчається у групі "+self.group+" вік: "+str(self.age)
#
# st1=Student() #об'єкт
# # print(st1.name,st1.group,st1.age)
# st2=Student(name="Паша",group="1113",age=14)
# # print(st2.name,st2.group,st2.age)
# print(st1)
# print(st2)

'''
Що таке клас у Python?
клас (Class) – це шаблон для створення об'єкту, користувацький тип, який описує устрій об'єктів, які йому належать. Клас як ескіз (прототип) будинку
Клас — це шаблон (або структура), який використовується для створення об'єктів. Він визначає, які властивості (атрибути) і функції (методи) матимуть створені на його основі об'єкти. Іншими словами, клас — це "чертеж", за яким можна створювати конкретні об'єкти з однаковою структурою.


Що таке атрибут класу?
Атрибут класу — це інформація про клас.

Що таке метод класу?
Метод класу — це як завдання, яке може виконувати об’єкт цього класу. Наприклад, у нашого героя можуть бути здібності: бігати, стріляти або зцілюватися. Ми описуємо ці дії як методи.
Уяви, що метод — це як кнопка: натиснув, і герой щось робить.


Що таке екземпляр класу?
Екземпляр класу — це готовий об’єкт, зроблений за кресленням (класом). Якщо клас — це креслення, то екземпляр — це вже побудований будинок.





'''